amurzeau/damc_stm32/src/stm32n6570-dk/Appli/Core/Src/main.c
  /*Configure GPIO pin : DEBUG_6_Pin */
  GPIO_InitStruct.Pin = DEBUG_6_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(DEBUG_6_GPIO_Port, &GPIO_InitStruct);

  /*Configure GPIO pin : DEBUG_5_Pin */
  GPIO_InitStruct.Pin = DEBUG_5_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(DEBUG_5_GPIO_Port, &GPIO_InitStruct);

  /*Configure GPIO pins : PQ4 TOF_LPn_Pin IMU_INT2_Pin IMU_INT1_Pin
                           TOF_INT_Pin */
  GPIO_InitStruct.Pin = GPIO_PIN_4|TOF_LPn_Pin|IMU_INT2_Pin|IMU_INT1_Pin
                          |TOF_INT_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  HAL_GPIO_Init(GPIOQ, &GPIO_InitStruct);

  /*Configure GPIO pin : NRST_CAM_Pin */
  GPIO_InitStruct.Pin = NRST_CAM_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  HAL_GPIO_Init(NRST_CAM_GPIO_Port, &GPIO_InitStruct);

  /*Configure GPIO pin : DEBUG_2_Pin */
  GPIO_InitStruct.Pin = DEBUG_2_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(DEBUG_2_GPIO_Port, &GPIO_InitStruct);

  /*Configure GPIO pins : PWR_USB2_EN_Pin AUDIO_RST_Pin */
  GPIO_InitStruct.Pin = PWR_USB2_EN_Pin|AUDIO_RST_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(GPIOB, &GPIO_InitStruct);

  /*Configure GPIO pin : User_Pin */
  GPIO_InitStruct.Pin = User_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_IT_RISING;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  HAL_GPIO_Init(User_GPIO_Port, &GPIO_InitStruct);

  /*Configure GPIO pin : LCD_NRST_Pin */
  GPIO_InitStruct.Pin = LCD_NRST_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(LCD_NRST_GPIO_Port, &GPIO_InitStruct);

  /*Configure GPIO pin : SD_SEL_Pin */
  GPIO_InitStruct.Pin = SD_SEL_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(SD_SEL_GPIO_Port, &GPIO_InitStruct);

  /*Configure GPIO pin : USER2_Pin */
  GPIO_InitStruct.Pin = USER2_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  HAL_GPIO_Init(USER2_GPIO_Port, &GPIO_InitStruct);

  /*Configure GPIO pin : DEBUG_3_Pin */
  GPIO_InitStruct.Pin = DEBUG_3_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(DEBUG_3_GPIO_Port, &GPIO_InitStruct);

  /*Configure GPIO pins : DEBUG_1_Pin DEBUG_4_Pin */
  GPIO_InitStruct.Pin = DEBUG_1_Pin|DEBUG_4_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(GPIOG, &GPIO_InitStruct);

  /*Configure GPIO pin : LED2_Pin */
  GPIO_InitStruct.Pin = LED2_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  HAL_GPIO_Init(LED2_GPIO_Port, &GPIO_InitStruct);

  /*Configure GPIO pin : USB1_OCP_Pin */
  GPIO_InitStruct.Pin = USB1_OCP_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(USB1_OCP_GPIO_Port, &GPIO_InitStruct);

  /* USER CODE BEGIN MX_GPIO_Init_2 */

  /* USER CODE END MX_GPIO_Init_2 */
}

/* USER CODE BEGIN 4 */

/* MPU Configuration */

extern uint8_t _stext;
extern uint8_t _etext;
extern uint8_t _sstack;
extern uint8_t _estack;
extern uint8_t _sromdata;
extern uint8_t _eromdata;
extern uint8_t _sdata;
extern uint8_t _end;
extern uint8_t __heap_start;
extern uint8_t __heap_end;
extern uint8_t _sdtcm;
extern uint8_t _edtcm;
void MPU_Config(void)
{
  MPU_Region_InitTypeDef MPU_InitStruct = {0};
  MPU_Attributes_InitTypeDef MPU_AttributesInit = {0};
  uint32_t primask_bit = __get_PRIMASK();
  __disable_irq();

  /* Disables the MPU */
  HAL_MPU_Disable();

  // Ensure addresses are 32 bytes aligned as required for MPU addresses
  assert((((uint32_t)&_stext) & 31) == 0);
  assert((((uint32_t)&_etext) & 31) == 0);
  assert((((uint32_t)&_estack) & 31) == 0);
  assert((((uint32_t)&_sromdata) & 31) == 0);
  assert((((uint32_t)&_eromdata) & 31) == 0);
  assert((((uint32_t)&_sdata) & 31) == 0);
  assert((((uint32_t)&_end) & 31) == 0);
  assert((((uint32_t)&__heap_start) & 31) == 0);
  assert((((uint32_t)&__heap_end) & 31) == 0);
  assert((((uint32_t)&_sdtcm) & 31) == 0);
  assert((((uint32_t)&_edtcm) & 31) == 0);

  // Ensure no overlap, else MemManage will be triggered on overlapped regions access
  assert((uint32_t)&_etext <= (uint32_t)&_sromdata);
  assert((uint32_t)&_eromdata <= (uint32_t)&_sdata);

  /** Initializes and configures the Region 0 (STM32 Peripherals) and the memory to be protected
  */
  MPU_InitStruct.Number = MPU_REGION_NUMBER0;
  MPU_InitStruct.Enable = MPU_REGION_ENABLE;
  MPU_InitStruct.BaseAddress = 0x40000000;
  MPU_InitStruct.LimitAddress = 0x5FFFFFFF;
  MPU_InitStruct.AttributesIndex = MPU_ATTRIBUTES_NUMBER0;
  MPU_InitStruct.AccessPermission = MPU_REGION_ALL_RW;
  MPU_InitStruct.DisableExec = MPU_INSTRUCTION_ACCESS_DISABLE;
  MPU_InitStruct.DisablePrivExec = MPU_PRIV_INSTRUCTION_ACCESS_DISABLE;
  MPU_InitStruct.IsShareable = MPU_ACCESS_OUTER_SHAREABLE;

  HAL_MPU_ConfigRegion(&MPU_InitStruct);

  /** Initializes and configures the Region 1 (ARM Peripherals) and the memory to be protected
  */
  MPU_InitStruct.Number++;
  MPU_InitStruct.BaseAddress = 0xE0000000;
  MPU_InitStruct.LimitAddress = 0xE0043FFF;
  MPU_InitStruct.AttributesIndex = MPU_ATTRIBUTES_NUMBER1;
  MPU_InitStruct.AccessPermission = MPU_REGION_ALL_RW;
  MPU_InitStruct.DisableExec = MPU_INSTRUCTION_ACCESS_DISABLE;
  MPU_InitStruct.DisablePrivExec = MPU_PRIV_INSTRUCTION_ACCESS_DISABLE;
  MPU_InitStruct.IsShareable = MPU_ACCESS_OUTER_SHAREABLE;

  HAL_MPU_ConfigRegion(&MPU_InitStruct);

  /** Initializes and configures the Region 2 (ROM text) and the memory to be protected
  */
  MPU_InitStruct.Number++;
  MPU_InitStruct.BaseAddress = (uint32_t)&_stext;
  MPU_InitStruct.LimitAddress = (uint32_t)&_etext - 1;
  MPU_InitStruct.AttributesIndex = MPU_ATTRIBUTES_NUMBER3;
  MPU_InitStruct.AccessPermission = MPU_REGION_ALL_RO;
  MPU_InitStruct.DisableExec = MPU_INSTRUCTION_ACCESS_ENABLE;
  MPU_InitStruct.DisablePrivExec = MPU_PRIV_INSTRUCTION_ACCESS_ENABLE;
  MPU_InitStruct.IsShareable = MPU_ACCESS_NOT_SHAREABLE;

  HAL_MPU_ConfigRegion(&MPU_InitStruct);

  /** Initializes and configures the Region 3 (cached ROM) and the memory to be protected
  */
  MPU_InitStruct.Number++;
  MPU_InitStruct.BaseAddress = (uint32_t)&_sromdata;
  MPU_InitStruct.LimitAddress = ((uint32_t)&_eromdata) - 1;
  MPU_InitStruct.AttributesIndex = MPU_ATTRIBUTES_NUMBER3;
  MPU_InitStruct.AccessPermission = MPU_REGION_ALL_RO;
  MPU_InitStruct.DisableExec = MPU_INSTRUCTION_ACCESS_DISABLE;
  MPU_InitStruct.DisablePrivExec = MPU_PRIV_INSTRUCTION_ACCESS_DISABLE;
  MPU_InitStruct.IsShareable = MPU_ACCESS_NOT_SHAREABLE;

  HAL_MPU_ConfigRegion(&MPU_InitStruct);

  /** Initializes and configures the Region 4 (cached RAM) and the memory to be protected
  */
  MPU_InitStruct.Number++;
  MPU_InitStruct.BaseAddress = (uint32_t)&_sdata;
  MPU_InitStruct.LimitAddress = ((((uint32_t)&_end) + 31) & 0xFFFFFFE0) - 1;
  MPU_InitStruct.AttributesIndex = MPU_ATTRIBUTES_NUMBER3;
  MPU_InitStruct.AccessPermission = MPU_REGION_ALL_RW;
  MPU_InitStruct.DisableExec = MPU_INSTRUCTION_ACCESS_DISABLE;
  MPU_InitStruct.DisablePrivExec = MPU_PRIV_INSTRUCTION_ACCESS_DISABLE;
  MPU_InitStruct.IsShareable = MPU_ACCESS_NOT_SHAREABLE;

  HAL_MPU_ConfigRegion(&MPU_InitStruct);

  /** Initializes and configures the Region 5 (Heap RAM non cached) and the memory to be protected
  */
  MPU_InitStruct.Number++;
  MPU_InitStruct.BaseAddress = (((uint32_t)&__heap_start) + 31) & 0xFFFFFFE0;
  MPU_InitStruct.LimitAddress = (((uint32_t)&__heap_end) & 0xFFFFFFE0) - 1;
  MPU_InitStruct.AttributesIndex = MPU_ATTRIBUTES_NUMBER2;
  MPU_InitStruct.AccessPermission = MPU_REGION_ALL_RW;
  MPU_InitStruct.DisableExec = MPU_INSTRUCTION_ACCESS_DISABLE;
  MPU_InitStruct.DisablePrivExec = MPU_PRIV_INSTRUCTION_ACCESS_DISABLE;
  MPU_InitStruct.IsShareable = MPU_ACCESS_NOT_SHAREABLE;

  HAL_MPU_ConfigRegion(&MPU_InitStruct);

  /** Initializes and configures the Region 6 (Stack RAM in DTCM) and the memory to be protected
  */
  MPU_InitStruct.Number++;
  MPU_InitStruct.BaseAddress = ((uint32_t)&_sstack) & 0xFFFFFFE0;
  MPU_InitStruct.LimitAddress = (uint32_t)&_estack - 1;
  MPU_InitStruct.AttributesIndex = MPU_ATTRIBUTES_NUMBER2;
  MPU_InitStruct.AccessPermission = MPU_REGION_ALL_RW;
  MPU_InitStruct.DisableExec = MPU_INSTRUCTION_ACCESS_DISABLE;
  MPU_InitStruct.DisablePrivExec = MPU_PRIV_INSTRUCTION_ACCESS_DISABLE;
  MPU_InitStruct.IsShareable = MPU_ACCESS_NOT_SHAREABLE;
  
  HAL_MPU_ConfigRegion(&MPU_InitStruct);

  /** Initializes and configures the Region 7 (DTCM RAM not cached) and the memory to be protected
  */
  MPU_InitStruct.Number++;
  MPU_InitStruct.BaseAddress =  (uint32_t)&_sdtcm;
  MPU_InitStruct.LimitAddress =  (uint32_t)&_edtcm - 1;
  MPU_InitStruct.AttributesIndex = MPU_ATTRIBUTES_NUMBER2;
  MPU_InitStruct.AccessPermission = MPU_REGION_ALL_RW;
  MPU_InitStruct.DisableExec = MPU_INSTRUCTION_ACCESS_DISABLE;
  MPU_InitStruct.DisablePrivExec = MPU_PRIV_INSTRUCTION_ACCESS_DISABLE;
  MPU_InitStruct.IsShareable = MPU_ACCESS_NOT_SHAREABLE;

  HAL_MPU_ConfigRegion(&MPU_InitStruct);

  /** Initializes and configures the Region 8 (NPU RAM, cached) and the memory to be protected
  */
  //MPU_InitStruct.Number++;
  //MPU_InitStruct.BaseAddress = 0x70000000;
  //MPU_InitStruct.LimitAddress = 0x78000000 - 1;
  //MPU_InitStruct.AttributesIndex = MPU_ATTRIBUTES_NUMBER3;
  //MPU_InitStruct.AccessPermission = MPU_REGION_ALL_RO;
  //MPU_InitStruct.DisableExec = MPU_INSTRUCTION_ACCESS_DISABLE;
  //MPU_InitStruct.DisablePrivExec = MPU_PRIV_INSTRUCTION_ACCESS_DISABLE;
  //MPU_InitStruct.IsShareable = MPU_ACCESS_NOT_SHAREABLE;

